{"class_name": "Model", "keras_version": "1.1.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 100], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "SimpleRNN", "config": {"U_regularizer": null, "name": "simplernn_1", "go_backwards": false, "output_dim": 100, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 100, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "input_length": null}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "simplernn_1"}, {"class_name": "SimpleRNN", "config": {"U_regularizer": null, "name": "simplernn_2", "go_backwards": true, "output_dim": 100, "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 100, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "input_length": null}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "simplernn_2"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["simplernn_1", 0, 0], ["simplernn_2", 0, 0]]], "name": "merge_1"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 11}}, "trainable": true, "name": "timedistributed_1"}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "timedistributed_1"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["timedistributed_1", 0, 0]]], "name": "activation_1"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["activation_1", 0, 0]], "name": "model_1"}}